/**
 * Created by tww316 on 16/7/28.
 */
const citys = [
  {
    "code": "001",
    "name": "北京",
  },
  {
    "code": "002",
    "name": "广州",
  },
  {
    "code": "003",
    "name": "杭州",
  },
  {
    "code": "004",
    "name": "上海",
  },
  {
    "code": "005",
    "name": "深圳",
  },
  {
    "code": "006",
    "name": "成都",
  },
  {
    "code": "007",
    "name": "大连",
  },
  {
    "code": "008",
    "name": "东莞",
  },
  {
    "code": "009",
    "name": "佛山",
  },
  {
    "code": "010",
    "name": "福州",
  },
  {
    "code": "011",
    "name": "济南",
  },
  {
    "code": "012",
    "name": "昆明",
  },
  {
    "code": "013",
    "name": "南京",
  },
  {
    "code": "014",
    "name": "南通",
  },
  {
    "code": "015",
    "name": "宁波",
  },
  {
    "code": "016",
    "name": "青岛",
  },
  {
    "code": "017",
    "name": "厦门",
  },
  {
    "code": "018",
    "name": "绍兴",
  },
  {
    "code": "019",
    "name": "苏州",
  },
  {
    "code": "020",
    "name": "天津",
  },
  {
    "code": "021",
    "name": "温州",
  },
  {
    "code": "022",
    "name": "无锡",
  },
  {
    "code": "023",
    "name": "武汉",
  },
  {
    "code": "024",
    "name": "西安",
  },
  {
    "code": "025",
    "name": "长沙",
  },
  {
    "code": "026",
    "name": "重庆",
  },
  {
    "code": "027",
    "name": "珠海",
  },
  {
    "code": "028",
    "name": "包头",
  },
  {
    "code": "029",
    "name": "常州",
  },
  {
    "code": "030",
    "name": "潮州",
  },
  {
    "code": "031",
    "name": "大庆",
  },
  {
    "code": "032",
    "name": "抚顺",
  },
  {
    "code": "033",
    "name": "赣州",
  },
  {
    "code": "034",
    "name": "广汉",
  },
  {
    "code": "035",
    "name": "贵阳",
  },
  {
    "code": "036",
    "name": "桂林",
  },
  {
    "code": "037",
    "name": "哈尔滨",
  },
  {
    "code": "038",
    "name": "海口",
  },
  {
    "code": "039",
    "name": "合肥",
  },
  {
    "code": "040",
    "name": "呼和浩特",
  },
  {
    "code": "041",
    "name": "湖州",
  },
  {
    "code": "042",
    "name": "惠州",
  },
  {
    "code": "043",
    "name": "吉安",
  },
  {
    "code": "044",
    "name": "吉林",
  },
  {
    "code": "045",
    "name": "嘉兴",
  },
  {
    "code": "046",
    "name": "江门",
  },
  {
    "code": "047",
    "name": "揭阳",
  },
  {
    "code": "048",
    "name": "金华",
  },
  {
    "code": "049",
    "name": "拉萨",
  },
  {
    "code": "050",
    "name": "兰州",
  },
  {
    "code": "051",
    "name": "乐山",
  },
  {
    "code": "052",
    "name": "丽水",
  },
  {
    "code": "053",
    "name": "茂名",
  },
  {
    "code": "054",
    "name": "梅州",
  },
  {
    "code": "055",
    "name": "南昌",
  },
  {
    "code": "056",
    "name": "南宁",
  },
  {
    "code": "057",
    "name": "秦皇岛",
  },
  {
    "code": "058",
    "name": "泉州",
  },
  {
    "code": "059",
    "name": "三亚",
  },
  {
    "code": "060",
    "name": "汕头",
  },
  {
    "code": "061",
    "name": "韶关",
  },
  {
    "code": "062",
    "name": "沈阳",
  },
  {
    "code": "063",
    "name": "十堰",
  },
  {
    "code": "064",
    "name": "石家庄",
  },
  {
    "code": "065",
    "name": "台州",
  },
  {
    "code": "066",
    "name": "太原",
  },
  {
    "code": "067",
    "name": "唐山",
  },
  {
    "code": "068",
    "name": "威海",
  },
  {
    "code": "069",
    "name": "潍坊",
  },
  {
    "code": "070",
    "name": "乌鲁木齐",
  },
  {
    "code": "071",
    "name": "咸宁",
  },
  {
    "code": "072",
    "name": "徐州",
  },
  {
    "code": "073",
    "name": "烟台",
  },
  {
    "code": "074",
    "name": "扬州",
  },
  {
    "code": "075",
    "name": "宜昌",
  },
  {
    "code": "076",
    "name": "义乌",
  },
  {
    "code": "077",
    "name": "银川",
  },
  {
    "code": "078",
    "name": "湛江",
  },
  {
    "code": "079",
    "name": "张家口",
  },
  {
    "code": "080",
    "name": "长春",
  },
  {
    "code": "081",
    "name": "肇庆",
  },
  {
    "code": "082",
    "name": "镇江",
  },
  {
    "code": "083",
    "name": "郑州",
  },
  {
    "code": "084",
    "name": "中山",
  },
  {
    "code": "085",
    "name": "株洲",
  },
  {
    "code": "086",
    "name": "淄博",
  },
  {
    "code": "087",
    "name": "安康",
  },
  {
    "code": "088",
    "name": "安宁",
  },
  {
    "code": "089",
    "name": "安庆",
  },
  {
    "code": "090",
    "name": "安阳",
  },
  {
    "code": "091",
    "name": "鞍山",
  },
  {
    "code": "092",
    "name": "白城",
  },
  {
    "code": "093",
    "name": "百色",
  },
  {
    "code": "094",
    "name": "蚌埠",
  },
  {
    "code": "095",
    "name": "宝鸡",
  },
  {
    "code": "096",
    "name": "保定",
  },
  {
    "code": "097",
    "name": "保山",
  },
  {
    "code": "098",
    "name": "毕节",
  },
  {
    "code": "099",
    "name": "滨州",
  },
  {
    "code": "100",
    "name": "沧州",
  },
  {
    "code": "101",
    "name": "昌吉",
  },
  {
    "code": "102",
    "name": "常德",
  },
  {
    "code": "103",
    "name": "巢湖",
  },
  {
    "code": "104",
    "name": "郴州",
  },
  {
    "code": "105",
    "name": "承德",
  },
  {
    "code": "106",
    "name": "池州",
  },
  {
    "code": "107",
    "name": "滁州",
  },
  {
    "code": "108",
    "name": "楚雄",
  },
  {
    "code": "109",
    "name": "达州",
  },
  {
    "code": "110",
    "name": "大理",
  },
  {
    "code": "111",
    "name": "大同",
  },
  {
    "code": "112",
    "name": "丹东",
  },
  {
    "code": "113",
    "name": "德阳",
  },
  {
    "code": "114",
    "name": "德州",
  },
  {
    "code": "115",
    "name": "东营",
  },
  {
    "code": "116",
    "name": "峨眉山",
  },
  {
    "code": "117",
    "name": "鄂州",
  },
  {
    "code": "118",
    "name": "恩施",
  },
  {
    "code": "119",
    "name": "抚州",
  },
  {
    "code": "120",
    "name": "阜新",
  },
  {
    "code": "121",
    "name": "阜阳",
  },
  {
    "code": "122",
    "name": "邯郸",
  },
  {
    "code": "123",
    "name": "汉中",
  },
  {
    "code": "124",
    "name": "菏泽",
  },
  {
    "code": "125",
    "name": "贺州",
  },
  {
    "code": "126",
    "name": "衡水",
  },
  {
    "code": "127",
    "name": "衡阳",
  },
  {
    "code": "128",
    "name": "红河州",
  },
  {
    "code": "129",
    "name": "淮安",
  },
  {
    "code": "130",
    "name": "淮北",
  },
  {
    "code": "131",
    "name": "淮南",
  },
  {
    "code": "132",
    "name": "黄冈",
  },
  {
    "code": "133",
    "name": "黄山",
  },
  {
    "code": "134",
    "name": "黄石",
  },
  {
    "code": "135",
    "name": "鸡西",
  },
  {
    "code": "136",
    "name": "吉首",
  },
  {
    "code": "137",
    "name": "济宁",
  },
  {
    "code": "138",
    "name": "佳木斯",
  },
  {
    "code": "139",
    "name": "焦作",
  },
  {
    "code": "140",
    "name": "锦州",
  },
  {
    "code": "141",
    "name": "晋中",
  },
  {
    "code": "142",
    "name": "荆门",
  },
  {
    "code": "143",
    "name": "荆州",
  },
  {
    "code": "144",
    "name": "景德镇",
  },
  {
    "code": "145",
    "name": "九江",
  },
  {
    "code": "146",
    "name": "开封",
  },
  {
    "code": "147",
    "name": "廊坊",
  },
  {
    "code": "148",
    "name": "丽江",
  },
  {
    "code": "149",
    "name": "连云港",
  },
  {
    "code": "150",
    "name": "辽阳",
  },
  {
    "code": "151",
    "name": "聊城",
  },
  {
    "code": "152",
    "name": "临汾",
  },
  {
    "code": "153",
    "name": "临沂",
  },
  {
    "code": "154",
    "name": "柳州",
  },
  {
    "code": "155",
    "name": "六安",
  },
  {
    "code": "156",
    "name": "龙岩",
  },
  {
    "code": "157",
    "name": "娄底",
  },
  {
    "code": "158",
    "name": "泸州",
  },
  {
    "code": "159",
    "name": "洛阳",
  },
  {
    "code": "160",
    "name": "吕梁",
  },
  {
    "code": "161",
    "name": "马鞍山",
  },
  {
    "code": "162",
    "name": "绵阳",
  },
  {
    "code": "163",
    "name": "牡丹江",
  },
  {
    "code": "164",
    "name": "南充",
  },
  {
    "code": "165",
    "name": "南平",
  },
  {
    "code": "166",
    "name": "南阳",
  },
  {
    "code": "167",
    "name": "内江",
  },
  {
    "code": "168",
    "name": "平顶山",
  },
  {
    "code": "169",
    "name": "萍乡",
  },
  {
    "code": "170",
    "name": "莆田",
  },
  {
    "code": "171",
    "name": "齐齐哈尔",
  },
  {
    "code": "172",
    "name": "钦州",
  },
  {
    "code": "173",
    "name": "琼海",
  },
  {
    "code": "174",
    "name": "衢州",
  },
  {
    "code": "175",
    "name": "曲靖",
  },
  {
    "code": "176",
    "name": "日照",
  },
  {
    "code": "177",
    "name": "三明",
  },
  {
    "code": "178",
    "name": "商丘",
  },
  {
    "code": "179",
    "name": "上饶",
  },
  {
    "code": "180",
    "name": "邵阳",
  },
  {
    "code": "181",
    "name": "石河子",
  },
  {
    "code": "182",
    "name": "四平",
  },
  {
    "code": "183",
    "name": "绥化",
  },
  {
    "code": "184",
    "name": "泰安",
  },
  {
    "code": "185",
    "name": "泰州",
  },
  {
    "code": "186",
    "name": "通化",
  },
  {
    "code": "187",
    "name": "通辽",
  },
  {
    "code": "188",
    "name": "铜陵",
  },
  {
    "code": "189",
    "name": "铜仁",
  },
  {
    "code": "190",
    "name": "芜湖",
  },
  {
    "code": "191",
    "name": "梧州",
  },
  {
    "code": "192",
    "name": "西宁",
  },
  {
    "code": "193",
    "name": "咸阳",
  },
  {
    "code": "194",
    "name": "湘潭",
  },
  {
    "code": "195",
    "name": "襄阳",
  },
  {
    "code": "196",
    "name": "孝感",
  },
  {
    "code": "197",
    "name": "忻州",
  },
  {
    "code": "198",
    "name": "新乡",
  },
  {
    "code": "199",
    "name": "新余",
  },
  {
    "code": "200",
    "name": "信阳",
  },
  {
    "code": "201",
    "name": "邢台",
  },
  {
    "code": "202",
    "name": "宿迁",
  },
  {
    "code": "203",
    "name": "宿州",
  },
  {
    "code": "204",
    "name": "许昌",
  },
  {
    "code": "205",
    "name": "雅安",
  },
  {
    "code": "206",
    "name": "延安",
  },
  {
    "code": "207",
    "name": "延边",
  },
  {
    "code": "208",
    "name": "盐城",
  },
  {
    "code": "209",
    "name": "宜春",
  },
  {
    "code": "210",
    "name": "益阳",
  },
  {
    "code": "211",
    "name": "永州",
  },
  {
    "code": "212",
    "name": "玉林",
  },
  {
    "code": "213",
    "name": "岳阳",
  },
  {
    "code": "214",
    "name": "运城",
  },
  {
    "code": "215",
    "name": "枣庄",
  },
  {
    "code": "216",
    "name": "张家界",
  },
  {
    "code": "217",
    "name": "漳州",
  },
  {
    "code": "218",
    "name": "长治",
  },
  {
    "code": "219",
    "name": "周口",
  },
  {
    "code": "220",
    "name": "自贡",
  },
  {
    "code": "221",
    "name": "北海",
  },
  {
    "code": "222",
    "name": "崇左",
  },
  {
    "code": "223",
    "name": "儋州",
  },
  {
    "code": "224",
    "name": "宁德",
  },
  {
    "code": "225",
    "name": "遂宁",
  },
  {
    "code": "226",
    "name": "文昌",
  },
  {
    "code": "227",
    "name": "玉溪",
  },
  {
    "code": "228",
    "name": "西昌",
  },
  {
    "code": "229",
    "name": "文山",
  },
  {
    "code": "230",
    "name": "宜州",
  },
  {
    "code": "231",
    "name": "宜宾",
  },
  {
    "code": "232",
    "name": "天水",
  },
  {
    "code": "233",
    "name": "攀枝花",
  },
  {
    "code": "234",
    "name": "巴中",
  },
  {
    "code": "235",
    "name": "广安",
  },
  {
    "code": "236",
    "name": "绵竹",
  },
  {
    "code": "237",
    "name": "江油",
  },
  {
    "code": "238",
    "name": "广元",
  },
  {
    "code": "239",
    "name": "眉山",
  },
  {
    "code": "240",
    "name": "渭南",
  },
  {
    "code": "241",
    "name": "泰兴",
  },
  {
    "code": "242",
    "name": "辽源",
  },
  {
    "code": "243",
    "name": "舟山",
  },
  {
    "code": "244",
    "name": "怀化",
  },
  {
    "code": "245",
    "name": "亳州",
  },
  {
    "code": "246",
    "name": "宣城",
  },
  {
    "code": "247",
    "name": "榆林",
  },
  {
    "code": "249",
    "name": "晋南",
  },
  {
    "code": "250",
    "name": "黄岩",
  },
  {
    "code": "251",
    "name": "晋北",
  },
  {
    "code": "252",
    "name": "阿拉尔",
  },
  {
    "code": "266",
    "name": "朔州",
  },
  {
    "code": "264",
    "name": "盘锦",
  },
  {
    "code": "276",
    "name": "涿州",
  },
  {
    "code": "271",
    "name": "赤峰",
  },
  {
    "code": "274",
    "name": "呼伦贝尔",
  },
  {
    "code": "272",
    "name": "松原",
  },
  {
    "code": "277",
    "name": "鹤壁",
  },
  {
    "code": "278",
    "name": "济源",
  },
  {
    "code": "279",
    "name": "濮阳",
  },
  {
    "code": "280",
    "name": "漯河",
  },
  {
    "code": "281",
    "name": "驻马店",
  },
  {
    "code": "282",
    "name": "新密",
  },
  {
    "code": "283",
    "name": "巩义",
  },
  {
    "code": "265",
    "name": "本溪",
  },
  {
    "code": "273",
    "name": "白山",
  },
  {
    "code": "270",
    "name": "铁岭",
  },
  {
    "code": "267",
    "name": "乌兰察布",
  },
  {
    "code": "268",
    "name": "鄂尔多斯",
  },
  {
    "code": "269",
    "name": "乌海",
  },
  {
    "code": "284",
    "name": "三门峡",
  },
  {
    "code": "262",
    "name": "普洱",
  },
  {
    "code": "51",
    "name": "张掖",
  },
  {
    "code": "52",
    "name": "庆阳",
  },
  {
    "code": "275",
    "name": "吴忠",
  },
  {
    "code": "285",
    "name": "黄骅",
  },
  {
    "code": "253",
    "name": "葫芦岛",
  },
  {
    "code": "254",
    "name": "凯里",
  },
  {
    "code": "255",
    "name": "安顺",
  },
  {
    "code": "256",
    "name": "儋州市",
  },
  {
    "code": "257",
    "name": "红河",
  },
  {
    "code": "258",
    "name": "伊宁市",
  },
  {
    "code": "259",
    "name": "罗定",
  },
  {
    "code": "260",
    "name": "阳江",
  },
  {
    "code": "261",
    "name": "伊宁",
  },
  {
    "code": "263",
    "name": "营口",
  },
  {
    "code": "286",
    "name": "莱芜",
  },
  {
    "code": "287",
    "name": "昆山",
  },
  {
    "code": "288",
    "name": "太仓",
  }
];

export default citys;
