/**
 * Created by tww316 on 16/7/28.
 */
const citys = [
  {
    "key": "001",
    "val": "北京",
  },
  {
    "key": "002",
    "val": "广州",
  },
  {
    "key": "003",
    "val": "杭州",
  },
  {
    "key": "004",
    "val": "上海",
  },
  {
    "key": "005",
    "val": "深圳",
  },
  {
    "key": "006",
    "val": "成都",
  },
  {
    "key": "007",
    "val": "大连",
  },
  {
    "key": "008",
    "val": "东莞",
  },
  {
    "key": "009",
    "val": "佛山",
  },
  {
    "key": "010",
    "val": "福州",
  },
  {
    "key": "011",
    "val": "济南",
  },
  {
    "key": "012",
    "val": "昆明",
  },
  {
    "key": "013",
    "val": "南京",
  },
  {
    "key": "014",
    "val": "南通",
  },
  {
    "key": "015",
    "val": "宁波",
  },
  {
    "key": "016",
    "val": "青岛",
  },
  {
    "key": "017",
    "val": "厦门",
  },
  {
    "key": "018",
    "val": "绍兴",
  },
  {
    "key": "019",
    "val": "苏州",
  },
  {
    "key": "020",
    "val": "天津",
  },
  {
    "key": "021",
    "val": "温州",
  },
  {
    "key": "022",
    "val": "无锡",
  },
  {
    "key": "023",
    "val": "武汉",
  },
  {
    "key": "024",
    "val": "西安",
  },
  {
    "key": "025",
    "val": "长沙",
  },
  {
    "key": "026",
    "val": "重庆",
  },
  {
    "key": "027",
    "val": "珠海",
  },
  {
    "key": "028",
    "val": "包头",
  },
  {
    "key": "029",
    "val": "常州",
  },
  {
    "key": "030",
    "val": "潮州",
  },
  {
    "key": "031",
    "val": "大庆",
  },
  {
    "key": "032",
    "val": "抚顺",
  },
  {
    "key": "033",
    "val": "赣州",
  },
  {
    "key": "034",
    "val": "广汉",
  },
  {
    "key": "035",
    "val": "贵阳",
  },
  {
    "key": "036",
    "val": "桂林",
  },
  {
    "key": "037",
    "val": "哈尔滨",
  },
  {
    "key": "038",
    "val": "海口",
  },
  {
    "key": "039",
    "val": "合肥",
  },
  {
    "key": "040",
    "val": "呼和浩特",
  },
  {
    "key": "041",
    "val": "湖州",
  },
  {
    "key": "042",
    "val": "惠州",
  },
  {
    "key": "043",
    "val": "吉安",
  },
  {
    "key": "044",
    "val": "吉林",
  },
  {
    "key": "045",
    "val": "嘉兴",
  },
  {
    "key": "046",
    "val": "江门",
  },
  {
    "key": "047",
    "val": "揭阳",
  },
  {
    "key": "048",
    "val": "金华",
  },
  {
    "key": "049",
    "val": "拉萨",
  },
  {
    "key": "050",
    "val": "兰州",
  },
  {
    "key": "051",
    "val": "乐山",
  },
  {
    "key": "052",
    "val": "丽水",
  },
  {
    "key": "053",
    "val": "茂名",
  },
  {
    "key": "054",
    "val": "梅州",
  },
  {
    "key": "055",
    "val": "南昌",
  },
  {
    "key": "056",
    "val": "南宁",
  },
  {
    "key": "057",
    "val": "秦皇岛",
  },
  {
    "key": "058",
    "val": "泉州",
  },
  {
    "key": "059",
    "val": "三亚",
  },
  {
    "key": "060",
    "val": "汕头",
  },
  {
    "key": "061",
    "val": "韶关",
  },
  {
    "key": "062",
    "val": "沈阳",
  },
  {
    "key": "063",
    "val": "十堰",
  },
  {
    "key": "064",
    "val": "石家庄",
  },
  {
    "key": "065",
    "val": "台州",
  },
  {
    "key": "066",
    "val": "太原",
  },
  {
    "key": "067",
    "val": "唐山",
  },
  {
    "key": "068",
    "val": "威海",
  },
  {
    "key": "069",
    "val": "潍坊",
  },
  {
    "key": "070",
    "val": "乌鲁木齐",
  },
  {
    "key": "071",
    "val": "咸宁",
  },
  {
    "key": "072",
    "val": "徐州",
  },
  {
    "key": "073",
    "val": "烟台",
  },
  {
    "key": "074",
    "val": "扬州",
  },
  {
    "key": "075",
    "val": "宜昌",
  },
  {
    "key": "076",
    "val": "义乌",
  },
  {
    "key": "077",
    "val": "银川",
  },
  {
    "key": "078",
    "val": "湛江",
  },
  {
    "key": "079",
    "val": "张家口",
  },
  {
    "key": "080",
    "val": "长春",
  },
  {
    "key": "081",
    "val": "肇庆",
  },
  {
    "key": "082",
    "val": "镇江",
  },
  {
    "key": "083",
    "val": "郑州",
  },
  {
    "key": "084",
    "val": "中山",
  },
  {
    "key": "085",
    "val": "株洲",
  },
  {
    "key": "086",
    "val": "淄博",
  },
  {
    "key": "087",
    "val": "安康",
  },
  {
    "key": "088",
    "val": "安宁",
  },
  {
    "key": "089",
    "val": "安庆",
  },
  {
    "key": "090",
    "val": "安阳",
  },
  {
    "key": "091",
    "val": "鞍山",
  },
  {
    "key": "092",
    "val": "白城",
  },
  {
    "key": "093",
    "val": "百色",
  },
  {
    "key": "094",
    "val": "蚌埠",
  },
  {
    "key": "095",
    "val": "宝鸡",
  },
  {
    "key": "096",
    "val": "保定",
  },
  {
    "key": "097",
    "val": "保山",
  },
  {
    "key": "098",
    "val": "毕节",
  },
  {
    "key": "099",
    "val": "滨州",
  },
  {
    "key": "100",
    "val": "沧州",
  },
  {
    "key": "101",
    "val": "昌吉",
  },
  {
    "key": "102",
    "val": "常德",
  },
  {
    "key": "103",
    "val": "巢湖",
  },
  {
    "key": "104",
    "val": "郴州",
  },
  {
    "key": "105",
    "val": "承德",
  },
  {
    "key": "106",
    "val": "池州",
  },
  {
    "key": "107",
    "val": "滁州",
  },
  {
    "key": "108",
    "val": "楚雄",
  },
  {
    "key": "109",
    "val": "达州",
  },
  {
    "key": "110",
    "val": "大理",
  },
  {
    "key": "111",
    "val": "大同",
  },
  {
    "key": "112",
    "val": "丹东",
  },
  {
    "key": "113",
    "val": "德阳",
  },
  {
    "key": "114",
    "val": "德州",
  },
  {
    "key": "115",
    "val": "东营",
  },
  {
    "key": "116",
    "val": "峨眉山",
  },
  {
    "key": "117",
    "val": "鄂州",
  },
  {
    "key": "118",
    "val": "恩施",
  },
  {
    "key": "119",
    "val": "抚州",
  },
  {
    "key": "120",
    "val": "阜新",
  },
  {
    "key": "121",
    "val": "阜阳",
  },
  {
    "key": "122",
    "val": "邯郸",
  },
  {
    "key": "123",
    "val": "汉中",
  },
  {
    "key": "124",
    "val": "菏泽",
  },
  {
    "key": "125",
    "val": "贺州",
  },
  {
    "key": "126",
    "val": "衡水",
  },
  {
    "key": "127",
    "val": "衡阳",
  },
  {
    "key": "128",
    "val": "红河州",
  },
  {
    "key": "129",
    "val": "淮安",
  },
  {
    "key": "130",
    "val": "淮北",
  },
  {
    "key": "131",
    "val": "淮南",
  },
  {
    "key": "132",
    "val": "黄冈",
  },
  {
    "key": "133",
    "val": "黄山",
  },
  {
    "key": "134",
    "val": "黄石",
  },
  {
    "key": "135",
    "val": "鸡西",
  },
  {
    "key": "136",
    "val": "吉首",
  },
  {
    "key": "137",
    "val": "济宁",
  },
  {
    "key": "138",
    "val": "佳木斯",
  },
  {
    "key": "139",
    "val": "焦作",
  },
  {
    "key": "140",
    "val": "锦州",
  },
  {
    "key": "141",
    "val": "晋中",
  },
  {
    "key": "142",
    "val": "荆门",
  },
  {
    "key": "143",
    "val": "荆州",
  },
  {
    "key": "144",
    "val": "景德镇",
  },
  {
    "key": "145",
    "val": "九江",
  },
  {
    "key": "146",
    "val": "开封",
  },
  {
    "key": "147",
    "val": "廊坊",
  },
  {
    "key": "148",
    "val": "丽江",
  },
  {
    "key": "149",
    "val": "连云港",
  },
  {
    "key": "150",
    "val": "辽阳",
  },
  {
    "key": "151",
    "val": "聊城",
  },
  {
    "key": "152",
    "val": "临汾",
  },
  {
    "key": "153",
    "val": "临沂",
  },
  {
    "key": "154",
    "val": "柳州",
  },
  {
    "key": "155",
    "val": "六安",
  },
  {
    "key": "156",
    "val": "龙岩",
  },
  {
    "key": "157",
    "val": "娄底",
  },
  {
    "key": "158",
    "val": "泸州",
  },
  {
    "key": "159",
    "val": "洛阳",
  },
  {
    "key": "160",
    "val": "吕梁",
  },
  {
    "key": "161",
    "val": "马鞍山",
  },
  {
    "key": "162",
    "val": "绵阳",
  },
  {
    "key": "163",
    "val": "牡丹江",
  },
  {
    "key": "164",
    "val": "南充",
  },
  {
    "key": "165",
    "val": "南平",
  },
  {
    "key": "166",
    "val": "南阳",
  },
  {
    "key": "167",
    "val": "内江",
  },
  {
    "key": "168",
    "val": "平顶山",
  },
  {
    "key": "169",
    "val": "萍乡",
  },
  {
    "key": "170",
    "val": "莆田",
  },
  {
    "key": "171",
    "val": "齐齐哈尔",
  },
  {
    "key": "172",
    "val": "钦州",
  },
  {
    "key": "173",
    "val": "琼海",
  },
  {
    "key": "174",
    "val": "衢州",
  },
  {
    "key": "175",
    "val": "曲靖",
  },
  {
    "key": "176",
    "val": "日照",
  },
  {
    "key": "177",
    "val": "三明",
  },
  {
    "key": "178",
    "val": "商丘",
  },
  {
    "key": "179",
    "val": "上饶",
  },
  {
    "key": "180",
    "val": "邵阳",
  },
  {
    "key": "181",
    "val": "石河子",
  },
  {
    "key": "182",
    "val": "四平",
  },
  {
    "key": "183",
    "val": "绥化",
  },
  {
    "key": "184",
    "val": "泰安",
  },
  {
    "key": "185",
    "val": "泰州",
  },
  {
    "key": "186",
    "val": "通化",
  },
  {
    "key": "187",
    "val": "通辽",
  },
  {
    "key": "188",
    "val": "铜陵",
  },
  {
    "key": "189",
    "val": "铜仁",
  },
  {
    "key": "190",
    "val": "芜湖",
  },
  {
    "key": "191",
    "val": "梧州",
  },
  {
    "key": "192",
    "val": "西宁",
  },
  {
    "key": "193",
    "val": "咸阳",
  },
  {
    "key": "194",
    "val": "湘潭",
  },
  {
    "key": "195",
    "val": "襄阳",
  },
  {
    "key": "196",
    "val": "孝感",
  },
  {
    "key": "197",
    "val": "忻州",
  },
  {
    "key": "198",
    "val": "新乡",
  },
  {
    "key": "199",
    "val": "新余",
  },
  {
    "key": "200",
    "val": "信阳",
  },
  {
    "key": "201",
    "val": "邢台",
  },
  {
    "key": "202",
    "val": "宿迁",
  },
  {
    "key": "203",
    "val": "宿州",
  },
  {
    "key": "204",
    "val": "许昌",
  },
  {
    "key": "205",
    "val": "雅安",
  },
  {
    "key": "206",
    "val": "延安",
  },
  {
    "key": "207",
    "val": "延边",
  },
  {
    "key": "208",
    "val": "盐城",
  },
  {
    "key": "209",
    "val": "宜春",
  },
  {
    "key": "210",
    "val": "益阳",
  },
  {
    "key": "211",
    "val": "永州",
  },
  {
    "key": "212",
    "val": "玉林",
  },
  {
    "key": "213",
    "val": "岳阳",
  },
  {
    "key": "214",
    "val": "运城",
  },
  {
    "key": "215",
    "val": "枣庄",
  },
  {
    "key": "216",
    "val": "张家界",
  },
  {
    "key": "217",
    "val": "漳州",
  },
  {
    "key": "218",
    "val": "长治",
  },
  {
    "key": "219",
    "val": "周口",
  },
  {
    "key": "220",
    "val": "自贡",
  },
  {
    "key": "221",
    "val": "北海",
  },
  {
    "key": "222",
    "val": "崇左",
  },
  {
    "key": "223",
    "val": "儋州",
  },
  {
    "key": "224",
    "val": "宁德",
  },
  {
    "key": "225",
    "val": "遂宁",
  },
  {
    "key": "226",
    "val": "文昌",
  },
  {
    "key": "227",
    "val": "玉溪",
  },
  {
    "key": "228",
    "val": "西昌",
  },
  {
    "key": "229",
    "val": "文山",
  },
  {
    "key": "230",
    "val": "宜州",
  },
  {
    "key": "231",
    "val": "宜宾",
  },
  {
    "key": "232",
    "val": "天水",
  },
  {
    "key": "233",
    "val": "攀枝花",
  },
  {
    "key": "234",
    "val": "巴中",
  },
  {
    "key": "235",
    "val": "广安",
  },
  {
    "key": "236",
    "val": "绵竹",
  },
  {
    "key": "237",
    "val": "江油",
  },
  {
    "key": "238",
    "val": "广元",
  },
  {
    "key": "239",
    "val": "眉山",
  },
  {
    "key": "240",
    "val": "渭南",
  },
  {
    "key": "241",
    "val": "泰兴",
  },
  {
    "key": "242",
    "val": "辽源",
  },
  {
    "key": "243",
    "val": "舟山",
  },
  {
    "key": "244",
    "val": "怀化",
  },
  {
    "key": "245",
    "val": "亳州",
  },
  {
    "key": "246",
    "val": "宣城",
  },
  {
    "key": "247",
    "val": "榆林",
  },
  {
    "key": "249",
    "val": "晋南",
  },
  {
    "key": "250",
    "val": "黄岩",
  },
  {
    "key": "251",
    "val": "晋北",
  },
  {
    "key": "252",
    "val": "阿拉尔",
  },
  {
    "key": "266",
    "val": "朔州",
  },
  {
    "key": "264",
    "val": "盘锦",
  },
  {
    "key": "276",
    "val": "涿州",
  },
  {
    "key": "271",
    "val": "赤峰",
  },
  {
    "key": "274",
    "val": "呼伦贝尔",
  },
  {
    "key": "272",
    "val": "松原",
  },
  {
    "key": "277",
    "val": "鹤壁",
  },
  {
    "key": "278",
    "val": "济源",
  },
  {
    "key": "279",
    "val": "濮阳",
  },
  {
    "key": "280",
    "val": "漯河",
  },
  {
    "key": "281",
    "val": "驻马店",
  },
  {
    "key": "282",
    "val": "新密",
  },
  {
    "key": "283",
    "val": "巩义",
  },
  {
    "key": "265",
    "val": "本溪",
  },
  {
    "key": "273",
    "val": "白山",
  },
  {
    "key": "270",
    "val": "铁岭",
  },
  {
    "key": "267",
    "val": "乌兰察布",
  },
  {
    "key": "268",
    "val": "鄂尔多斯",
  },
  {
    "key": "269",
    "val": "乌海",
  },
  {
    "key": "284",
    "val": "三门峡",
  },
  {
    "key": "262",
    "val": "普洱",
  },
  {
    "key": "51",
    "val": "张掖",
  },
  {
    "key": "52",
    "val": "庆阳",
  },
  {
    "key": "275",
    "val": "吴忠",
  },
  {
    "key": "285",
    "val": "黄骅",
  },
  {
    "key": "253",
    "val": "葫芦岛",
  },
  {
    "key": "254",
    "val": "凯里",
  },
  {
    "key": "255",
    "val": "安顺",
  },
  {
    "key": "256",
    "val": "儋州市",
  },
  {
    "key": "257",
    "val": "红河",
  },
  {
    "key": "258",
    "val": "伊宁市",
  },
  {
    "key": "259",
    "val": "罗定",
  },
  {
    "key": "260",
    "val": "阳江",
  },
  {
    "key": "261",
    "val": "伊宁",
  },
  {
    "key": "263",
    "val": "营口",
  },
  {
    "key": "286",
    "val": "莱芜",
  },
  {
    "key": "287",
    "val": "昆山",
  },
  {
    "key": "288",
    "val": "太仓",
  }
];

export default citys;
