/**
 * Created by tww316 on 16/7/28.
 */
const citys = [
  {
    "key": "001",
    "val": "北京"
  },
  {
    "key": "002",
    "val": "上海"
  },
  {
    "key": "003",
    "val": "广州"
  },
  {
    "key": "004",
    "val": "杭州"
  },
  {
    "key": "005",
    "val": "深圳"
  },
  {
    "key": "006",
    "val": "南京"
  },
  {
    "key": "007",
    "val": "天津"
  },
  {
    "key": "008",
    "val": "重庆"
  },
  {
    "key": "009",
    "val": "成都"
  },
  {
    "key": "010",
    "val": "昆明"
  },
  {
    "key": "011",
    "val": "贵阳"
  },
  {
    "key": "012",
    "val": "南宁"
  },
  {
    "key": "013",
    "val": "长沙"
  },
  {
    "key": "014",
    "val": "武汉"
  },
  {
    "key": "015",
    "val": "福州"
  },
  {
    "key": "016",
    "val": "南昌"
  },
  {
    "key": "017",
    "val": "合肥"
  },
  {
    "key": "018",
    "val": "郑州"
  },
  {
    "key": "019",
    "val": "济南"
  },
  {
    "key": "020",
    "val": "太原"
  },
  {
    "key": "021",
    "val": "西安"
  },
  {
    "key": "022",
    "val": "石家庄"
  },
  {
    "key": "023",
    "val": "沈阳"
  },
  {
    "key": "024",
    "val": "长春"
  },
  {
    "key": "025",
    "val": "哈尔滨"
  }
];

export default citys;
